src/DataProcessors/ЗагрузкаПеремещенийИзТаблчногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПеремещенийИзТаблчногоДокумента</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОперацийПеремещенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещенияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СвободноеПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТопЛог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТопЛог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровVMI</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровВПути</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ОтказыПоЗаявкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКРезервированию</xr:Item>
				<xr:Item>AccumulationRegister.ПополнениеСклада</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
				<xr:Item>InformationRegister.ИсторияЗаявокПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещенияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>если реквизит заполнен - значит идет приемка из ТопЛог</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеСсылкаТопЛог</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновленИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеВыгружатьВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поступление</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНеПринято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ЗагрузкаПеремещенийИзТаблчногоДокумента/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайла(Элемент, ИмяФайла);	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ВыборФайла(Элемент, ИмяФайла)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Exel 2003 (*.xls)|*.xls| Exel (*.xlsx))|*.xlsx| ТабДокумент 1С (*.mxl)|*.mxl";
	ДиалогВыбораФайла.Расширение = "xml";
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла = Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
			
	КонецЕсли;
	
	ПрочитатьТабличныйДокументНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещения(Команда)
	Если ПроверитьЗаполнение() тогда  
		ВыполнитьЗагрузкуНаКлиенте();
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
 Процедура ВыполнитьЗагрузкуНаКлиенте();
	 
	 СтруктураПолей = новый Структура;
	 СтруктураПолей.Вставить("Артикул",КолонкаАвртикул);
	 СтруктураПолей.Вставить("Изготовитель",КолонкаИзготовитель);
	 СтруктураПолей.Вставить("Количество",КолонкаКоличество);
	 Если ДелитьНаНесколькоДокументов тогда 
	 СтруктураПолей.Вставить("Разделитель",КолонкаРазделитель);	
	 КонецЕсли;
 
 	 ВыполнитьЗагрузкуНаСервере(СтруктураПолей);
	
 КонецПроцедуры	
 
 &НаСервере 
 Процедура ВыполнитьЗагрузкуНаСервере(СтруктураПолей)
	 //Подрузумевается ,что один лист только грузится 
	 Если НЕ ТабличныйДокумент.Области.Количество() тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный формат табличного документа ");
		Возврат
	КонецЕсли;	 
	 ОбластьЗагрузки  = ТабличныйДокумент.ПолучитьОбласть(ТабличныйДокумент.Области[0].Имя);
	 
	  КоличествоСтрок =  ОбластьЗагрузки.ПолучитьРазмерОбластиДанныхПоВертикали();
	  
	  ТаблицаРезультата = новый ТаблицаЗначений;
	  ТаблицаРезультата.Колонки.Добавить("НомерСтроки",новый ОписаниеТипов("Число"));
	  ТаблицаРезультата.Колонки.Добавить("Артикул",новый ОписаниеТипов("Строка",,,,,,новый КвалификаторыСтроки(100)));
	  ТаблицаРезультата.Колонки.Добавить("Изготовитель",новый ОписаниеТипов("Строка",,,,,,новый КвалификаторыСтроки(200)));
	  ТаблицаРезультата.Колонки.Добавить("Количество",новый ОписаниеТипов("Число"));
	  ТаблицаРезультата.Колонки.Добавить("Разделитель",новый ОписаниеТипов("Число"));
	  
	  Для ИндексТекСтроки = НомерПервойСтроки по КоличествоСтрок цикл 
		  НоваяЗаписьРезультат = ТаблицаРезультата.Добавить();
		 НоваяЗаписьРезультат.НомерСтроки = ИндексТекСтроки+ НомерПервойСтроки;
		  Для Каждого Колонка из СтруктураПолей цикл 
		  
		  ОбластьСтроки = ОбластьЗагрузки.ПолучитьОбласть("R"+Формат(ИндексТекСтроки,"ЧГ=0" )+"C"+Колонка.Значение); 
		  НоваяЗаписьРезультат[колонка.Ключ] = ПолучитьЗначениеЯчейки(ОбластьСтроки,ТипЗнч(НоваяЗаписьРезультат[колонка.Ключ]) = Тип("Строка"));
		  
		  КонецЦикла;;
		  
	  КонецЦикла;	 
	  
	  ОбработанаяТаблица = ПолучитьОбработануюТаблицу(ТаблицаРезультата);
	
	Если ОбработанаяТаблица.Количество() тогда  
		СоздатьДокументыНаСервере(ОбработанаяТаблица);
	иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет даных для формирования");
	КонецЕсли;
	
 КонецПроцедуры	
 
 &НаСервере
 Функция ПолучитьОбработануюТаблицу(ТаблицаРезультата)
   Запрос = новый Запрос("ВЫБРАТЬ
                         |	ТЧЗагрузки.Артикул,
                         |	ТЧЗагрузки.Изготовитель,
                         |	ТЧЗагрузки.Количество,
                         |	ТЧЗагрузки.НомерСтроки,
                         |	ТЧЗагрузки.Разделитель
                         |ПОМЕСТИТЬ вТЧЗагрузки
                         |ИЗ
                         |	&ТЧЗагрузки КАК ТЧЗагрузки
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	Номенклатура.Ссылка КАК Номенклатура,
                         |	ВЫБОР
                         |		КОГДА Номенклатура.Ссылка ЕСТЬ NULL
                         |			ТОГДА ЛОЖЬ
                         |		ИНАЧЕ ИСТИНА
                         |	КОНЕЦ КАК НоменклатураНайдена,
                         |	вТЧЗагрузки.Артикул,
                         |	вТЧЗагрузки.Изготовитель,
                         |	вТЧЗагрузки.Количество,
                         |	вТЧЗагрузки.НомерСтроки,
                         |	вТЧЗагрузки.Разделитель
                         |ПОМЕСТИТЬ ТЧНоменклатуры
                         |ИЗ
                         |	вТЧЗагрузки КАК вТЧЗагрузки
                         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
                         |		ПО вТЧЗагрузки.Артикул = Номенклатура.Артикул
                         |			И вТЧЗагрузки.Изготовитель = Номенклатура.Изготовитель.Наименование
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	ТоварыНаСкладахОстатки.Номенклатура,
                         |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0)) КАК КоличествоОстатка
                         |ПОМЕСТИТЬ ТаблицаОстатка
                         |ИЗ
                         |	РегистрНакопления.ТоварыНаСкладах.Остатки(
                         |			,
                         |			Склад = &СкладОтправитель
                         |				И Номенклатура В
                         |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
                         |						ТЧНоменклатуры.Номенклатура КАК Номенклатура
                         |					ИЗ
                         |						ТЧНоменклатуры КАК ТЧНоменклатуры
                         |					ГДЕ
                         |						ТЧНоменклатуры.НоменклатураНайдена = ИСТИНА)
                         |				И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК ТоварыНаСкладахОстатки
                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТоваров.Остатки(
                         |				,
                         |				Склад = &СкладОтправитель
                         |					И Номенклатура В
                         |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
                         |							ТЧНоменклатуры.Номенклатура КАК Номенклатура
                         |						ИЗ
                         |							ТЧНоменклатуры КАК ТЧНоменклатуры
                         |						ГДЕ
                         |							ТЧНоменклатуры.НоменклатураНайдена = ИСТИНА)
                         |					И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК РезервыТоваровОстатки
                         |		ПО ТоварыНаСкладахОстатки.Номенклатура = РезервыТоваровОстатки.Номенклатура
                         |			И ТоварыНаСкладахОстатки.Склад = РезервыТоваровОстатки.Склад
                         |			И ТоварыНаСкладахОстатки.Качество = РезервыТоваровОстатки.Качество
                         |
                         |СГРУППИРОВАТЬ ПО
                         |	ТоварыНаСкладахОстатки.Номенклатура
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	ТЧНоменклатуры.Артикул,
                         |	ТЧНоменклатуры.Изготовитель,
                         |	ТЧНоменклатуры.НомерСтроки
                         |ИЗ
                         |	ТЧНоменклатуры КАК ТЧНоменклатуры
                         |ГДЕ
                         |	ТЧНоменклатуры.НоменклатураНайдена = ЛОЖЬ
                         |;
                         |
                         |////////////////////////////////////////////////////////////////////////////////
                         |ВЫБРАТЬ
                         |	ТЧНоменклатуры.Номенклатура,
                         |	ТЧНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
                         |	ТЧНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
                         |	ВЫБОР
                         |		КОГДА ТЧНоменклатуры.Количество <= ТаблицаОстатка.КоличествоОстатка
                         |			ТОГДА ТЧНоменклатуры.Количество
                         |		ИНАЧЕ ТаблицаОстатка.КоличествоОстатка
                         |	КОНЕЦ КАК Количество,
                         |	ЗНАЧЕНИЕ(Справочник.Качество.Новый) КАК Качество,
                         |	ТЧНоменклатуры.Разделитель,
                         |	ВЫБОР
                         |		КОГДА ТЧНоменклатуры.Количество <= ТаблицаОстатка.КоличествоОстатка
                         |			ТОГДА ТЧНоменклатуры.Количество
                         |		ИНАЧЕ ТаблицаОстатка.КоличествоОстатка
                         |	КОНЕЦ КАК КоличествоПлан
                         |ИЗ
                         |	ТЧНоменклатуры КАК ТЧНоменклатуры
                         |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатка КАК ТаблицаОстатка
                         |		ПО ТЧНоменклатуры.Номенклатура = ТаблицаОстатка.Номенклатура
                         |ГДЕ
                         |	ТЧНоменклатуры.НоменклатураНайдена = ИСТИНА
                         |	И ВЫБОР
                         |			КОГДА ТЧНоменклатуры.Количество <= ТаблицаОстатка.КоличествоОстатка
                         |				ТОГДА ТЧНоменклатуры.Количество
                         |			ИНАЧЕ ТаблицаОстатка.КоличествоОстатка
                         |		КОНЕЦ > 0" );
   запрос.УстановитьПараметр("ТЧЗагрузки",ТаблицаРезультата);
   запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
   

   Результат = запрос.ВыполнитьПакет();
  ВыборкаОшибок = Результат[3].Выбрать();
  пока ВыборкаОшибок.следующий()	цикл
	  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пропущена строка № "+ВыборкаОшибок.НомерСтроки+" в файле с артикулом "+ВыборкаОшибок.Артикул+". Указанный в ней товар не найден по артикулу и изготовителю") ;
  КонецЦикла; 
  Возврат Результат[4].Выгрузить();
  
	  
 
 КонецФункции // ПолучитьОбработануюТаблицу()
 

&НаСервере
Процедура СоздатьДокументыНаСервере(ТаблицаРезультата)
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка 
	Если ДелитьНаНесколькоДокументов тогда 
		таблРазделителя = ТаблицаРезультата.Скопировать(,"Разделитель");
		таблРазделителя.Свернуть("Разделитель");
		Для каждого Строка из таблРазделителя цикл 
			СтрокиРезультата = ТаблицаРезультата.НайтиСтроки(Новый Структура("Разделитель",Строка.Разделитель));
			СоздатьДокументНаСервере(ТаблицаРезультата.Скопировать(СтрокиРезультата));		
		КонецЦикла;	
	иначе 
		СоздатьДокументНаСервере(ТаблицаРезультата);
	КонецЕсли;	
		
      ЗафиксироватьТранзакцию();
  Исключение
      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
     ОтменитьТранзакцию();
     
 КонецПопытки;
	

КонецПроцедуры // СоздатьДокументыНаСервере()

&НаСервере
Процедура СоздатьДокументНаСервере(ТабличнаяЧасть)
	
	НовПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовПеремещение.Дата = ТекущаяДата();
	НовПеремещение.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение ;  
	НовПеремещение.Комментарий = "Загружен из электронного файла " +ТекущаяДата(); 
	НовПеремещение.Организация = Константы.ОрганизацияПоУмолчаниюБезнал.Получить(); 
	НовПеремещение.СкладОтправитель = СкладОтправитель; 
	НовПеремещение.СкладПолучатель = СкладПолучатель; 
	НовПеремещение.ФилиалОтправитель = СкладОтправитель.Филиал ; 
	НовПеремещение.ФилиалПолучатель = СкладПолучатель.Филиал; 
	НовПеремещение.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый;
	НовПеремещение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовПеремещение.Товары.Загрузить(ТабличнаяЧасть);
	
	НовПеремещение.Записать(РежимЗаписиДокумента.Проведение);
	
	СозданыеДокументы.Добавить(НовПеремещение.Ссылка);


КонецПроцедуры // СоздатьДокументНаСервере()

 &НаСервереБезКонтекста
 Функция ПолучитьЗначениеЯчейки(ОбластьСтроки,ЭтоСтрока = Истина)
	 ТекущаяОбласть = ОбластьСтроки.ТекущаяОбласть;
	 Попытка
		 ЗначениеЯчейки = ТекущаяОбласть.Значение;        
		Если ЭтоСтрока тогда 
		ЗначениеЯчейки = СокрЛП(Формат(ЗначениеЯчейки, "ЧГ=0"));
		КонецЕсли;
	 Исключение
		 Если ЭтоСтрока  тогда 
			 ЗначениеЯчейки = СокрЛП(ТекущаяОбласть.Текст);    
			 Если ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
				 ЗначениеЯчейки = СокрЛП(ЗначениеЯчейки);
			 Иначе
				 ЗначениеЯчейки = Неопределено;
			 КонецЕсли;
		 иначе 
			 Попытка 
				 ЗначениеЯчейки =  XMLЗначение(Тип("Число"),ТекущаяОбласть.Текст) ;
			 Исключение
				 ЗначениеЯчейки = Неопределено;
			 КонецПопытки;
		 КонецЕсли;
	 КонецПопытки;
	 
	 Возврат ЗначениеЯчейки
	 
 
 КонецФункции // ПолучитьЗначениеЯчейки()

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	ПрочитатьТабличныйДокументНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ПрочитатьТабличныйДокументНаКлиенте()
	 	ТабличныйДокумент.Очистить();
		СозданыеДокументы.Очистить();

	Файл =   новый Файл(ИмяФайла);
	Если Файл.Существует() тогда 
	ТабличныйДокумент.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение);
иначе 
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный файл не обноружен , введите правильный путь к файлу")
	КонецЕсли;

	
//	ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);

//	АдресХранилища = ПоместитьВоВременноеХранилище(ДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
//	
//	ПрочитатьТабличныйДокументНаСервере(АдресХранилища);	
	
 КонецПроцедуры	


&НаКлиенте
 Процедура ДелитьНаНесколькоДокументовПриИзменении(Элемент)
	 Элементы.КолонкаРазделитель.Доступность = ДелитьНаНесколькоДокументов;
 КонецПроцедуры


&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 НомерПервойСтроки =1;
 КонецПроцедуры
